#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = "Изменилась цена";

	ПересчетСуммы(ТекущиеДанные, ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = "Изменилась количество";

	ПересчетСуммы(ТекущиеДанные, ТекстСообщения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пересчет суммы.
// 
// Параметры:
//  СтрокаТовары - ДанныеФормыЭлементКоллекции - Строка товары
//  ТекстСообщения - Строка - Текст сообщения
&НаКлиенте
Процедура ПересчетСуммы(СтрокаТовары, ТекстСообщения)
	СтрокаТовары.Сумма = СтрокаТовары.Количество * СтрокаТовары.Цена;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = (ТекстСообщения);
	Сообщение.Сообщить();
КонецПроцедуры

#КонецОбласти